$(function(){

    // 全局变量
    // 总的试题信息
    var resource = [
        // “题目”，“选项信息ABCD”，“正确答案”，“题目ID”
        /*
        *可以不用设置正确答案数组，
        *直接将选中答案字符与题目字符比较，
        *比较相等即为答对
        */

        // 期中一个正确答案字符串等于题目
        ['题号0', '题目0', '答案A', '答案B', '答案C', '答案D'], 
        [1, '题目1', '答案1', '答案2', '答案3', '题目1'],
        [2, '题目2', '答案1', '答案2', '答案3', '题目2'],
        [3, '题目3', '答案1', '答案2', '答案3', '题目3'],
        [4, '题目4', '答案1', '答案2', '答案3', '题目4'],
        [5, '题目5', '答案1', '答案2', '答案3', '题目5'],
        [6, '题目6', '答案1', '答案2', '答案3', '题目6'],
        [7, '题目7', '答案1', '答案2', '答案3', '题目7'],
        [8, '题目8', '答案1', '答案2', '答案3', '题目8'],
        [9, '题目9', '答案1', '答案2', '答案3', '题目9'],
        [10, '题目10', '答案1', '答案2', '答案3', '题目10'],
        [11, '题目11', '答案1', '答案2', '答案3', '题目11'],
        [12, '题目12', '答案1', '答案2', '答案3', '题目12'],
        [13, '题目13', '答案1', '答案2', '答案3', '题目13'],
        [14, '题目14', '答案1', '答案2', '答案3', '题目14'],
        [15, '题目15', '答案1', '答案2', '答案3', '题目15'],
        [16, '题目16', '答案1', '答案2', '答案3', '题目16'],
        [17, '题目17', '答案1', '答案2', '答案3', '题目17'],
        [18, '题目18', '答案1', '答案2', '答案3', '题目18'],
        [19, '题目19', '答案1', '答案2', '答案3', '题目19'],
        [20, '题目20', '答案1', '答案2', '答案3', '题目20'],
        [21, '题目21', '答案1', '答案2', '答案3', '题目21'],
        [22, '题目22', '答案1', '答案2', '答案3', '题目22'],
        [23, '题目23', '答案1', '答案2', '答案3', '题目23'],
        [24, '题目24', '答案1', '答案2', '答案3', '题目24'],
        [25, '题目25', '答案1', '答案2', '答案3', '题目25'],
        [26, '题目26', '答案1', '答案2', '答案3', '题目26'],
        [27, '题目27', '答案1', '答案2', '答案3', '题目27'],
        [28, '题目28', '答案1', '答案2', '答案3', '题目28'],
        [29, '题目29', '答案1', '答案2', '答案3', '题目29'],
        [30, '题目30', '答案1', '答案2', '答案3', '题目30'],
        [31, '题目31', '答案1', '答案2', '答案3', '题目31'],
        [32, '题目32', '答案1', '答案2', '答案3', '题目32'],
        [33, '题目33', '答案1', '答案2', '答案3', '题目33'],
        [34, '题目34', '答案1', '答案2', '答案3', '题目34'],
        [35, '题目35', '答案1', '答案2', '答案3', '题目35'],
        [36, '题目36', '答案1', '答案2', '答案3', '题目36'],
        [37, '题目37', '答案1', '答案2', '答案3', '题目37'],
        [38, '题目38', '答案1', '答案2', '答案3', '题目38'],
        [39, '题目39', '答案1', '答案2', '答案3', '题目39'],
        [40, '题目40', '答案1', '答案2', '答案3', '题目40']
    ];

    // 存放正确题目编号
    var right = [];

    // 存放错误题目编号
    var wrong = [];

    // 应作答题目编号
    var subject = [];

    // 题目总数，用 resource.length-1
    var max = resource.length-1;
    console.log(resource.length-1);
    // 应该答题的数目
    var item = 4;

    // 生成随机答题号码，存放在 subject 中
    function buildSubject (max, item){ // 题号从 1 到 max；取 item 道题目
        var localArr = [];
        for(var i =0; i < max; i++){
            localArr[i] = i + 1;
        }
        
        //排序
        localArr.sort(function() {
            return 0.5 - Math.random();
        }); 

        // 取出需要的数组
        subject = localArr.slice(0, item);
    }
    buildSubject(max, item); //执行函数
    console.log(subject); // 打印出答题题号



 /*   (function(){
        $('#index .start').click(function(){
            $('#index').hide();
            class1();
        });
    })(); //开始测试后执行，隐藏#index

    // 开始绘制第一个页面
    var class1 = function(){
        $('#main').html('<p>pppp</p>');
    };

    // 在 max 个数中，随机出 num 个不重复的随机数
    var random = function(num, max){ // num:需要随机数的个数，max:题目最大数量
        for(var i = 0; i < num; i++){

            //生成一个伪随机数
            var suiji = Math.random();
            var res = suiji * (max - 1) + 1;
            var result = Math.round(res);
            console.log(result);
        };
    };
    random(3, 4);
*/











}); // jq函数结束
